Repository: 84000/data-translation-memory
Catalog: toh182-v2.tmx
Source language: bo
Languages: en

source: སྙིང་བརྩེ་བ་ཅན། སྙིང་རྗེ་དང་ལྡན་པ། དེས་པ། འགྲོགས་ན་བདེ་བ། མཁས་པ། མཛངས་པ། གསལ་བ། ཡིད་གཞུངས་པ། ཤེས་ཉེན་དང་ལྡན་པ། ལེ་ལོ་མེད་པ། ཤིན་ཏུ་དུལ་བ། དགེ་དེས་ཆེ་བ། སྒྱུ་ཅན་མ་ཡིན་པ། གཡོ་མེད་པ། མི་རྩུབ་པ། མི་བརླང་བ། དྲང་བ།
en: He was affectionate, filled with compassion, noble-minded, amicable, learned, wise, clear, intelligent, knowledgeable, devoid of laziness, disciplined, wholesome, honest, straight, soft, gentle, and sincere.

source: ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པ་དང་། འཐབ་པ་དང་། ཁྲོ་བ་དང་། ཕྲག་དོག་དང་། སེར་སྣ་དང་། ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་དང་། ལྷག་པར་ཞེན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། མ་རིག་པ་དང་བྲལ་བ་དང་། བསོད་ནམས་དང་ལྡན་པ་
en: As he was free of pride, vanity, haughtiness, strife, hostility, envy, miserliness, selfishness, possessiveness, attachment, suffering, unhappiness, and ignorance, he was endowed with merit.

source: ཞིག་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་གོ། །
en: Present in the assembly

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རིའི་ཕུག་དང་། ཟོམ་དང་། རི་སུལ་དང་། གསེབ་དང་། སྨན་ལྗོངས་ན་སེང་གེའི་མཆོག་རྣམ་པར་བསྒྱིངས་ཤིང་ང་རོ་རྣམ་པར་སྒྲོགས་པ་ལྟ་བུའི་མིའི་དབང་པོའི་གཙུག་གི་ནོར་བུ་སྟན་ལས་ལངས་ཏེ
en: At one point, the bodhisattva great being Crown Jewel of the Lord of Men Resembling a Sublime Lion Sporting and Roaring in Mountain Caves, Peaks, Clefts, Valleys, and Meadows stood up,

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས།
en: draped his shawl over one shoulder, and

source: པུས་མོ་གཡས་པའི་ལྷ་ང་པད་མའི་སྙིང་པོ་ལ་བཙུགས་ཏེ།
en: knelt with his right knee on the calyx of a lotus flower.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: With his palms joined together he bowed down toward the Blessed One and said,

source: གལ་ཏེ་བདག་གིས་ཞུས་ནས་ཞུ་བ་ལན་གདབ་པའི་སླད་དུ། བཅོམ་ལྡན་འདས་ཀྱིས་སྐབས་ཕྱེ་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་བདག་ཕྱོགས་འགའ་ཞིག་ཞུ་བར་འཚལ་ལོ། །
en: “If the Blessed One would grant me the opportunity, I have a few questions I would like to put to the Blessed One, the thus-gone, worthy, and perfect Buddha.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རིའི་ཕུག་དང་། ཟོམ་དང་། རི་སུལ་དང་། གསེབ་དང་། སྨན་ལྗོངས་ན་སེང་གེའི་མཆོག་རྣམ་པར་བསྒྱིངས་ཤིང་ང་རོ་རྣམ་པར་སྒྲོགས་པ་ལྟ་བུའི་མིའི་དབང་པོའི་གཙུག་གི་ནོར་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One replied to the bodhisattva great being Crown Jewel of the Lord of Men Resembling a Sublime Lion Sporting and Roaring in Mountain Caves, Peaks, Clefts, Valleys, and Meadows,

source: རིགས་ཀྱི་བུ་ཁྱོད་ལ་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་རྟག་ཏུ་སྐབས་འབྱེད་ཀྱིས།
en: “Noble son, all the buddhas and bodhisattvas will always grant you this opportunity.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཅི་དང་ཅི་འདོད་པ་དྲིས་ཤིག་དང་།
en: Noble son, ask whatever you wish to the thus-gone, worthy, and perfect Buddha.

source: ངས་དྲིས་པ་དེ་དང་དེའི་ལན་བཏབ་པས་ཁྱོད་ཀྱི་སེམས་རངས་པར་བྱའོ། །
en: I will answer your questions and bring satisfaction to your mind.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རིའི་ཕུག་དང་། ཟོམ་དང་། རི་སུལ་དང་། གསེབ་དང་། སྨན་ལྗོངས་ན་སེང་གེའི་མཆོག་རྣམ་པར་བསྒྱིངས་ཤིང་། ང་རོ་རྣམ་པར་སྒྲོགས་པ་ལྟ་བུའི་མིའི་དབང་པོའི་གཙུག་གི་ནོར་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At these words from the Blessed One, the bodhisattva great being Crown Jewel of the Lord of Men Resembling a Sublime Lion Sporting and Roaring in Mountain Caves, Peaks, Clefts, Valleys, and Meadows asked,

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དང་པོ་སེམས་བསྐྱེད་པས་གང་ལ་མངོན་པར་བརྩོན་པར་བགྱི་ལགས།
en: “Blessed One, after having first given rise to the mind set on awakening, in what should noble sons and daughters exert themselves?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རིའི་ཕུག་དང་། ཟོམ་དང་། རི་སུལ་དང་། གསེབ་དང་། སྨན་ལྗོངས་ན་སེང་གེའི་མཆོག་རྣམ་པར་བསྒྱིངས་ཤིང་། ང་རོ་རྣམ་པར་སྒྲོགས་པ་ལྟ་བུའི་མིའི་དབང་པོའི་གཙུག་གི་ནོར་བུ་ལ་ལེགས་སོ། །ཞེས་བྱ་བ་བྱིན་ཏེ། རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ། །
en: When he heard this question, the Blessed One expressed his approval to the bodhisattva great being Crown Jewel of the Lord of Men Resembling a Sublime Lion Sporting and Roaring in Mountain Caves, Peaks, Clefts, Valleys, and Meadows, saying, “Excellent, noble son, excellent!

source: རིགས་ཀྱི་བུ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་ཡོངས་སུ་དྲི་བར་སེམས་པ་ནི་ཁྱོད་ཡང་ལེགས་སོ། །
en: Noble son, your wish to investigate this matter is excellent!

source: དེའི་ཕྱིར་རིགས་ཀྱི་བུ་ཁྱོད་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་བཤད་དོ། །
en: Noble son, listen carefully and pay attention: I shall now explain this.”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རིའི་ཕུག་དང་། ཟོམ་དང་། རི་སུལ་དང་། གསེབ་དང་། སྨན་ལྗོངས་ན་སེང་གེའི་མཆོག་རྣམ་པར་བསྒྱིངས་ཤིང་། ང་རོ་རྣམ་པར་སྒྲོགས་པ་ལྟ་བུའི་མིའི་དབང་པོའི་གཙུག་གི་ནོར་བུས། བཅོམ་ལྡན་འདས་ལ་ལེགས་སོ་ཞེས་གསོལ་ནསབཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: The bodhisattva great being Crown Jewel of the Lord of Men Resembling a Sublime Lion Sporting and Roaring in Mountain Caves, Peaks, Clefts, Valleys, and Meadows agreed to this and listened to the Blessed One as instructed.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One then said,

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་པོ་སེམས་བསྐྱེད་པས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དག་ལ་མངོན་པར་བརྩོན་པར་བྱའོ། །
en: “Noble son, after having first given rise to the mind set on awakening, bodhisattva great beings should strive diligently on the path of the ten virtuous actions.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དག་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན་
en: Noble son, how do bodhisattva great beings strive diligently on the path of the ten virtuous actions?

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྲོག་གཅོད་པ་སྤངས་པ་ཡིན། ལོག་པར་ལྟ་བའི་བར་དག་སྤངས་པ་ཡིན་ནོ། །
en: Noble son, bodhisattva great beings do so by abandoning killing and so forth, up until wrong views.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྲོག་གཅོད་པ་སྤངས་པ་ཇི་ལྟ་བུ་ཡིན་ཞེ་ན།
en: “Noble son, how do bodhisattva great beings abandon killing?

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Noble son, bodhisattvas do so by reflecting in this way:

source: སྲོག་ཅེས་བྱ་བ་ནི་ཐ་ན་སྲོག་ཆགས་གྲོག་སྦུར་ཡན་ཆད་ལ་ཡང་སྡུག་ཅིང་ཕངས་ལ་དགའ་ཞིང་ཡིད་དུ་འོང་བ་ཡིན་ཏེ།
en: ‘Even the tiniest of insects, such as an ant, is fond of its life; it cherishes it, likes it, and enjoys it.

source: བདག་ལ་ཡང་སྲོག་འདི་སྡུག་ཅིང་ཕངས་ལ་དགའ་ཞིང་ཡིད་དུ་འོང་བ་ཡིན་གྱིས་
en: I, too, am fond of my life; I, too, cherish it, like it, and enjoy it. Therefore,

source: སུ་ཡང་བདག་ལ་གསོད་པ་འམ། གསོད་དུ་འཇུག་པའམ། བསད་པ་ལ་རྗེས་སུ་ཡི་རང་བར་མ་གྱུར་ཅིག་བདག་གིས་ཀྱང་སུ་ལ་ཡང་བསད་པར་མི་བྱ། གསོད་དུ་གཞུག་པར་མི་བྱ། གསོད་པ་ལ་རྗེས་སུ་ཡི་རང་བར་མི་བྱའོ་
en: just as I want no one to kill me, order someone to kill me, or rejoice in my killing, I myself will never kill, order someone to kill, or rejoice in the killing of anyone!’

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྲོག་གཅོད་པ་སྤངས་པ་ཡིན་ནོ། །
en: Noble son, this is how bodhisattva great beings abandon killing.

source: དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: Regarding this, it is said:

source: མངལ་ན་གནས་པ་ཡན་ཆད་ཀྱང་། །ཀུན་ལ་སྲོག་ནི་སྡུག་པའི་ཕྱིར། །
en: “From the time of being in their mother’s womb, All beings cherish their lives. Therefore,

source: བདག་གི་སྲོག་ཕངས་གང་ཡིན་པ། །དེ་ནི་སྲོག་ཆགས་གསོད་མི་བྱེད། །
en: those who hold their lives dear Should not kill any living being.

source: དེ་ལ་མ་བྱིན་པར་ལེན་པ་སྤངས་པ་ཇི་ལྟ་བུ་ཡིན་ཞེ་ན།
en: “How do bodhisattvas abandon taking what is not given?

source: ནོར་ཞེས་བྱ་བ་ནི་ཐ་ན་རིགས་ངན་དང་། གཡུང་པོ་ཡན་ཆད་ལ་ཡང་སྡུག་ཅིང་ཕངས་ལ་དགའ་ཞིང་ཡིད་དུ་འོང་བ་ཡིན་ཏེ།
en: ‘Even the members of low castes and outcasts are fond of wealth; they cherish it, like it, and enjoy it.

source: བདག་ལ་ཡང་ནོར་འདི་སྡུག་ཅིང་ཕངས་ལ་དགའ་ཞིང་ཡིད་དུ་འོང་བ་ཡིན་གྱིས་
en: I am also fond of wealth; I, too, cherish it, like it, and enjoy it. Therefore,

source: སུ་ཡང་བདག་ལ་འཕྲོག་པའམ། འཕྲོག་ཏུ་འཇུག་པའམ། ཕྲོགས་པ་ལ་རྗེས་སུ་ཡི་རང་བར་མ་གྱུར་ཅིག །
en: just as I want no one to rob me, order someone to rob me, or rejoice in someone robbing me,

source: བདག་གིས་ཀྱང་སུ་ལ་ཡང་དབྲོག་པར་མི་བྱ།
en: I myself will never rob,

source: འཕྲོག་ཏུ་གཞུག་པར་མི་བྱ།
en: [I myself] will never [rob,] order someone to rob, [or rejoice in anyone being robbed!’]

source: ཕྲོགས་པ་ལ་རྗེས་སུ་ཡི་རང་བར་མི་བྱའོ་
en: [I myself] will never [rob, order someone to rob, or] rejoice in anyone being robbed!’

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མ་བྱིན་པར་ལེན་པ་སྤངས་པ་ཡིན་ནོ། །
en: Noble son, this is how bodhisattva great beings abandon taking what is not given.

source: ཤིང་དང་བོང་བ་ཡན་ཆད་ལ། །གཞན་གྱི་བོར་བར་གྱུར་པ་ཡང་། །གང་ལ་ཕ་ཡི་ནོར་སྡུག་པ། །དེ་ནི་ནོར་ལ་འཕྲོག་མི་བྱེད། །
en: “Those who cherish their patrimony Should never steal any wealth, Even mere pieces of wood, clods of dirt, Or what is rejected by others.

source: དེ་ལ་འདོད་པས་ལོག་པར་གཡེམ་པ་སྤངས་པ་ཇི་ལྟ་བུ་ཡིན་ཞེ་ན།
en: “How do bodhisattvas abandon sexual misconduct?

source: ཆུང་མ་ཞེས་བྱ་བ་ནི་ཐ་ན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་གྱུར་པ་རྣམས་ལ་ཡང་། སྡུག་ཅིང་ཕངས་ལ་དགའ་ཞིང་ཡིད་དུ་འོང་བ་ཡིན་ཏེ།
en: ‘Even beings born as animals are fond of their mates; they cherish them, like them, and enjoy them.

source: བདག་ལ་ཡང་ཆུང་མ་འདི་སྡུག་ཅིང་ཕངས་ལ་དགའ་ཞིང་ཡིད་དུ་འོང་བ་ཡིན་གྱིས།
en: I am also fond of my wife; I, too, cherish her, like her, and enjoy being with her. Therefore,

source: སུ་ཡང་བདག་ལ་འཕྲོག་པའམ། འཕྲོག་ཏུ་འཇུག་པའམ། ཕྲོགས་པ་ལ་རྗེས་སུ་ཡི་རང་བའམ། ནན་གྱིས་མནན་ཏེདགའ་དགུར་ཡོངས་སུ་ལོངས་སྤྱད་པར་མ་གྱུར་ཅིག །
en: just as I want no one to ravish her, order someone to ravish her, or rejoice in someone ravishing her, harassing her, or raping her,

source: བདག་གིས་ཀྱང་སུ་ལ་ཡང་དབྲོག་པར་མི་བྱ། འཕྲོག་ཏུ་གཞུག་པར་མི་བྱ། ཕྲོགས་པ་ལ་རྗེས་སུ་ཡི་རང་བར་མི་བྱ། ནན་གྱིས་མནན་ཏེ། དགའ་དགུར་ལོངས་སྤྱད་པར་མི་བྱའོ་
en: I myself will never ravish, order someone to ravish, or rejoice in someone ravishing, harassing, or raping anyone’s spouse!’

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་སྤངས་པ་ཡིན་ནོ། །
en: Noble son, this is how bodhisattva great beings abandon sexual misconduct.

source: བྲན་མོར་གྱུར་པ་ཡན་ཆད་ཀྱང་། །གཞན་གྱི་བཞག་པར་གྱུར་པ་ལ། །གང་ལ་རང་གི་ཆུང་མ་སྡུག །དེ་ནི་ཆུང་མ་འཕྲོག་མི་བྱེད། །
en: “Those who are fond of their own spouses Should not ravage another’s spouse, Not even servants Retained by others.

source: དེ་ལ་བརྫུན་དུ་སྨྲ་བ་སྤངས་པ་ཇི་ལྟ་བུ་ཡིན་ཞེ་ན།
en: “How do bodhisattvas abandon lying?

source: བདེན་པ་ཞེས་བྱ་བ་དེ་ནི་ཐ་ན་གནོད་སྦྱིན་དང་། འབྱུང་པོ་དང་། ཤ་ཟ་རྣམས་ལ་ཡང་སྡུག་ཅིང་ཕངས་ལ་དགའ་ཞིང་ཡིད་དུ་འོང་བ་ཡིན་ཏེ།
en: ‘Even yakṣas, bhūtas, and piśācas are fond of the truth; they cherish it, like it, and enjoy it.

source: བདག་ལ་ཡང་བདེན་པ་འདི་སྡུག་ཅིང་ཕངས་ལ། དགའ་ཞིང་ཡིད་དུ་འོང་བ་ཡིན་གྱིས།
en: I am also fond of the truth; I, too, cherish it, like it, and enjoy it. Therefore,

source: སུ་ཡང་བདག་ལ་བརྫུན་དུ་སྨྲ་བས་སུན་འབྱིན་པའམ། སུན་འབྱིན་དུ་འཇུག་པའམ། སུན་ཕྱུང་བ་ལ་རྗེས་སུ་ཡི་རང་བར་མ་གྱུར་ཅིག །
en: just as I want no one to deceive me, order someone to deceive me, or rejoice in someone deceiving me by telling lies,

source: བདག་གིས་ཀྱང་སུ་ལ་ཡང་བརྫུན་དུ་སྨྲ་བས་སུན་དབྱུང་བར་མི་བྱ། སུན་འབྱིན་དུ་གཞུག་པར་མི་བྱ། སུན་ཕྱུང་བ་ལ་རྗེས་སུ་ཡི་རང་བར་མི་བྱའོ་
en: I myself will never deceive, order someone to deceive, or rejoice in anyone being deceived by lies!’

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྫུན་དུ་སྨྲ་བ་སྤངས་པ་ཡིན་ནོ། །
en: Noble son, this is how bodhisattva great beings abandon lying.

source: གནོད་སྦྱིན་འབྱུང་པོ་ཡན་ཆད་ཀྱང་། །གང་ལ་བདེན་པར་སྨྲ་བ་སྡུག །ཤེས་རབ་ཅན་དེ་བརྫུན་ཚིག་གིས། །ལུས་ཅན་རྣམས་ལ་སུན་མི་འབྱིན། །
en: “The wise who are fond of the truth, As even yakṣas and bhūtas are, Should never deceive others By telling lies.

source: དེ་ལ་ཕྲ་མའི་ཚིག་སྤངས་པ་ཇི་ལྟ་བུ་ཡིན་ཞེ་ན།
en: “How do bodhisattvas abandon slander?

source: ཕྲ་མའི་ཚིག་ཅེས་བྱ་བ་ནི། ཐ་ན་གང་ཟག་ཕྲ་མ་ཅན་རྣམས་ལ་ཡང་ཡིད་མི་སྡུག་ཅིང་མི་འདོད་ལ། མི་དགའ་ཞིང་ཡིད་དུ་མི་འོང་བ་ཡིན་ཏེ།
en: ‘Even slanderous people find slander unpleasant; they do not want to hear it, do not like it, and do not enjoy it.

source: བདག་ལ་ཡང་ཕྲ་མའི་ཚིག་འདི་མི་སྡུག་ཅིང་མི་འདོད་ལ་མི་དགའ་ཞིང་ཡིད་དུ་མི་འོང་བ་ཡིན་གྱིས།
en: I also find slander unpleasant; I do not want to hear it, do not like it, and do not enjoy it. Therefore,

source: སུ་ཡང་བདག་ལ་ཕྲ་མ་ཟེར་བས་གླེང་བའམ། གླེང་དུ་འཇུག་པའམ། གླེངས་པ་ལ་རྗེས་སུ་ཡི་རང་བར་མ་གྱུར་ཅིག །
en: just as I want no one to speak about me in a defamatory way, order someone to speak about me so, or rejoice in someone so speaking about me,

source: བདག་གིས་ཀྱང་སུ་ལ་ཡང་ཕྲ་མ་ཟེར་བས་གླེང་བར་མི་བྱ།
en: I myself will never speak about anyone in a defamatory way,

source: གླེང་དུ་གཞུག་པར་མི་བྱ།
en: I myself will never [speak about anyone in a defamatory way,] order someone to speak so, [or rejoice in anyone being so spoken about!’]

source: གླེངས་པ་ལ་རྗེས་སུ་ཡི་རང་བར་མི་བྱའོ་
en: I myself will never [speak about anyone in a defamatory way, order someone to speak so,] or rejoice in anyone being so spoken about!’

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྲ་མའི་ཚིག་སྤངས་པ་ཡིན་ནོ། །
en: Noble son, this is how bodhisattva great beings abandon slander.

source: དེ་ལ་ངག་རྩུབ་པོ་སྨྲ་བ་སྤངས་པ་ཇི་ལྟ་བུ་ཡིན་ཞེ་ན།
en: “How do bodhisattvas abandon harsh words?

source: ངག་རྩུབ་པོ་ཞེས་བྱ་བ་ནི་ཐ་ན་གང་ཟག་ངག་རྩུབ་པོ་དང་ལྡན་པ་རྣམས་ལ་ཡང་མི་སྡུག་ཅིང་མི་འདོད་ལ་མི་དགའ་ཞིང་ཡིད་དུ་མི་འོང་བ་ཡིན་ཏེ།
en: ‘Even those who are used to speaking harsh words find such words unpleasant; they do not want to hear them, do not like them, and do not enjoy them.

source: བདག་ལ་ཡང་ངག་རྩུབ་པོ་འདི་མི་སྡུག་ཅིང་མི་འདོད་ལ་མི་དགའ་ཞིང་ཡིད་དུ་མི་འོང་བ་ཡིན་གྱིས།
en: I, too, find harsh words unpleasant; I do not want to hear them, do not like them, and do not enjoy them. Therefore,

source: སུ་ཡང་བདག་ལ་ངག་རྩུབ་པོ་སྨྲ་བ་དང་། གཏུམ་པའི་ཚིག་དང་། བརླང་བའི་ཚིག་དང་། མི་བདེན་པའི་ཚིག་གིས་ཐོ་འཚམ་པའམ། ཐོ་འཚམ་དུ་འཇུག་པའམ། ཐོ་འཚམས་པ་ལ་རྗེས་སུ་ཡི་རང་བར་མ་གྱུར་ཅིག །
en: just as I want no one to hurt me, order someone to hurt me, or rejoice in someone hurting me with harsh, cruel, insulting, or defamatory words,

source: བདག་གིས་ཀྱང་སུ་ལ་ཡང་ངག་རྩུབ་པོ་སྨྲ་བ་དང་། གཏུམ་པའི་ཚིག་དང་། བརླང་བའི་ཚིག་དང་། མི་བདེན་པའི་ཚིག་གིས་ཐོ་བཙམ་པར་མི་བྱ།
en: I myself will never hurt anyone with harsh, cruel, insulting, or defamatory words,

source: ཐོ་བཙམ་དུ་གཞུག་པར་མི་བྱ།
en: I myself will never [hurt anyone with harsh, cruel, insulting, or defamatory words,] order someone to be so hurt, [or rejoice in anyone being so hurt!’]

source: ཐོ་བཙམས་པ་ལ་རྗེས་སུ་ཡི་རང་བར་མི་བྱའོ་
en: I myself will never [hurt anyone with harsh, cruel, insulting, or defamatory words, order someone to be so hurt, or] rejoice in anyone being so hurt!’

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ངག་རྩུབ་པོ་སྤངས་པ་ཡིན་ནོ། །
en: Noble son, this is how bodhisattva great beings abandon harsh words.

source: གང་དག་སུ་ཡང་རུང་བ་ལ། །ཕྲ་མ་ངག་རྩུབ་མི་སྡུག་པ། །དེ་ནི་ཕྲ་མ་མི་ཟེར་ཏེ། །རྩུབ་པའི་ཚིག་ཀྱང་སྲུང་བར་བྱེད། །
en: “Those who consider slanderous and harsh words To be unpleasant Should not express slander, And should guard against harsh words.

source: དེ་ལ་ཚིག་ཀྱལ་པ་སྤངས་པ་ཇི་ལྟ་བུ་ཡིན་ཞེ་ན།
en: “How do bodhisattvas abandon idle gossip?

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Noble son, bodhisattva great beings do so by reflecting in this way:

source: ཚིག་ཀྱལ་པ་ཞེས་བྱ་བ་ནི་ཐ་ན་གང་ཟག་ཚིག་ཀྱལ་པ་ཅན་དག་ལ་ཡང་མི་སྡུག་ཅིང་མི་འདོད་ལ་མི་དགའ་ཞིང་ཡིད་དུ་མི་འོང་བ་ཡིན་ཏེ།
en: ‘Even those who engage in idle gossip find meaningless conversations unpleasant; they do not want to hear them, do not like them, and do not enjoy them.

source: བདག་ལ་ཡང་ཚིག་ཀྱལ་པ་འདི་མི་སྡུག་ཅིང་མི་འདོད་ལ། མི་དགའ་ཞིང་ཡིད་དུ་མི་འོང་བ་ཡིན་གྱིས།
en: I also find meaningless conversations unpleasant; I do not want to hear them, do not like them, and do not enjoy them. Therefore,

source: སུ་ཡང་བདག་ལ་ཚིག་ཀྱལ་པ་སྨྲས་པས་དྲན་པར་བྱེད་པའམ། དྲན་པར་བྱེད་དུ་འཇུག་པའམ། དྲན་པར་བྱས་པ་ལ་རྗེས་སུ་ཡི་རང་བར་མ་གྱུར་ཅིག །
en: just as I want no one to speak about me surreptitiously, order someone to speak about me so, or rejoice in someone so speaking about me,

source: བདག་གིས་ཀྱང་སུ་ལ་ཡང་ཚིག་ཀྱལ་པ་སྨྲ་བས་དྲན་པར་མི་བྱ།
en: I myself will never speak about anyone surreptitiously,

source: དྲན་པར་བྱེད་དུ་མི་གཞུག །
en: I myself will never [speak about anyone surreptitiously,] order someone to speak about anyone so, [or rejoice in someone so speaking about anyone!’]

source: དྲན་པར་བྱས་པ་ལ་རྗེས་སུ་ཡི་རང་བར་མི་བྱའོ་
en: I myself will never [speak about anyone surreptitiously, order someone to speak about anyone so, or] rejoice in someone so speaking about anyone!’

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚིག་ཀྱལ་པ་སྤངས་པ་ཡིན་ནོ། །
en: Noble son, this is how bodhisattva great beings abandon idle gossip.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྣབ་སེམས་སྤངས་པ་ཇི་ལྟ་བུ་ཡིན་ཞེ་ན།
en: “How do bodhisattva great beings abandon covetousness?

source: བརྣབ་སེམས་ཞེས་བྱ་བ་ནི་ཐ་ན་གང་ཟག་བརྣབ་སེམས་ཅན་རྣམས་ལ་ཡང་མི་སྡུག་ཅིང་མི་འདོད་ལ་མི་དགའ་ཞིང་ཡིད་དུ་མི་འོང་བ་ཡིན་ཏེ།
en: ‘Even covetous people find covetousness unpleasant; they do not wish for it, do not like it, and do not enjoy it.

source: བདག་ལ་ཡང་བརྣབ་སེམས་འདི་མི་སྡུག་ཅིང་མི་འདོད་ལ་མི་དགའ་ཞིང་ཡིད་དུ་མི་འོང་བ་ཡིན་གྱིས།
en: I, too, find covetousness unpleasant; I do not wish for it, do not like it, and do not enjoy it. Therefore,

source: སུ་ཡང་བདག་ལ་བརྣབ་སེམས་ཀྱི་ཚིག་གིས་རྗོད་པའམ། རྗོད་དུ་འཇུག་པའམ། བརྗོད་པ་ལ་རྗེས་སུ་ཡི་རང་བར་མ་གྱུར་ཅིག །
en: just as I want no one to speak to me covetously, order anyone to speak to me so, or rejoice in someone so speaking to me,

source: བདག་གིས་ཀྱང་སུ་ལ་ཡང་བརྣབ་སེམས་ཀྱི་ཚིག་གིས་བརྗོད་པར་མི་བྱ།
en: I myself will never speak covetously to anyone,

source: རྗོད་དུ་གཞུག་པར་མི་བྱ།
en: I myself will never [speak covetously to anyone,] order others to speak so, [or rejoice in someone so speaking to anyone!’]

source: བརྗོད་པ་ལ་རྗེས་སུ་ཡི་རང་བར་མི་བྱའོ་
en: I myself will never [speak covetously to anyone, order others to speak so, or] rejoice in someone so speaking to anyone!’

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྣབ་སེམས་སྤངས་པ་ཡིན་ནོ། །
en: Noble son, this is how bodhisattva great beings abandon covetousness.

source: ཀྱལ་པའི་ཚིག་དང་བརྣབ་སེམས་གཉིས། །གང་ཞིག་བདག་ཉིད་མི་འདོད་པ། །དེ་ནི་ཀྱལ་པའི་ཚིག་མི་སྨྲ། །བརྣབ་སེམས་ཀྱང་ནི་སྲུང་བར་བྱེད། །
en: “All those who dislike Idle gossip and covetousness Should not engage in meaningless conversations, And should guard against covetousness.

source: དེ་ལ་གནོད་སེམས་སྤངས་པ་ཇི་ལྟ་བུ་ཡིན་ཞེ་ན།
en: “How do bodhisattvas abandon ill will?

source: གནོད་སེམས་ཞེས་བྱ་བ་ནི་ཐ་ན་གང་ཟག་གནོད་སེམས་སུ་གྱུར་པའི་སེམས་དང་ལྡན་པ་རྣམས་ལ་ཡང་། མི་སྡུག་ཅིང་མི་འདོད་ལ་མི་དགའ་ཞིང་ཡིད་དུ་མི་འོང་བ་ཡིན་ཏེ
en: ‘Even those who entertain malicious thoughts find ill will unpleasant; they do not wish for it, do not like it, and do not enjoy it.

source: བདག་ལ་ཡང་གནོད་སེམས་འདི་མི་སྡུག་ཅིང་མི་འདོད་ལ་མི་དགའ་ཞིང་ཡིད་དུ་མི་འོང་བ་ཡིན་གྱིས།
en: I, too, find ill will unpleasant; I do not wish for it, do not like it, and do not enjoy it. Therefore,

source: སུ་ཡང་བདག་ལ་གནོད་སེམས་ཀྱི་ཚིག་གིས་འཆད་པའམ། འཆད་དུ་འཇུག་པའམ། བཤད་པ་ལ་རྗེས་སུ་ཡི་རང་བར་མ་གྱུར་ཅིག །
en: just as I want no one to express malicious words to me, order someone to express them, or rejoice in someone expressing them,

source: བདག་གིས་ཀྱང་སུ་ལ་ཡང་གནོད་སེམས་ཀྱི་ཚིག་གིས་བཤད་པར་མི་བྱ། འཆད་དུ་གཞུག་པར་མི་བྱ། བཤད་པ་ལ་རྗེས་སུ་ཡི་རང་བར་མི་བྱའོ་
en: I myself will never express malicious words to anyone, order someone to express them, or rejoice in someone expressing them!’

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གནོད་སེམས་སྤངས་པ་ཡིན་ནོ། །
en: Noble son, this is how bodhisattva great beings abandon ill will.

source: དེ་ལ་ལོག་པར་ལྟ་བ་སྤངས་པ་ཇི་ལྟ་བུ་ཡིན་ཞེ་ན།
en: “How do bodhisattvas abandon wrong views?

source: ལོག་པར་ལྟ་བ་ཞེས་བྱ་བ་ནི་ཐ་ན་གང་ཟག་ལོག་པར་ཞུགས་པ་རྣམས་ལ་ཡང་མི་སྡུག་ཅིང་མི་འདོད་ལ་མི་དགའ་ཞིང་ཡིད་དུ་མི་འོང་བ་ཡིན་ཏེ།
en: ‘Even those who entertain wrong views find wrong views unpleasant; they do not wish for them, do not like them, and do not enjoy them.

source: བདག་ལ་ཡང་ལོག་པར་ལྟ་བ་འདི་མི་སྡུག་ཅིང་མི་འདོད་ལ་མི་དགའ་ཞིང་ཡིད་དུ་མི་འོང་བ་ཡིན་གྱིས།
en: I, too, find wrong views unpleasant; I do not wish for them, do not like them, and do not enjoy them. Therefore,

source: སུ་ཡང་བདག་ལ་ལོག་པར་ལྟ་བའི་ཚིག་གིས་སྟོན་པའམ། སྟོན་དུ་འཇུག་པའམ། བསྟན་པ་ལ་རྗེས་སུ་ཡི་རང་བར་མ་གྱུར་ཅིག །
en: just as I want no one to teach me wrong views, order someone to teach them to me, or rejoice in someone teaching them to me,

source: བདག་གིས་ཀྱང་སུ་ལ་ཡང་ལོག་པར་ལྟ་བའི་ཚིག་གིས་བསྟན་པར་མི་བྱ། སྟོན་དུ་གཞུག་པར་མི་བྱ། བསྟན་པ་ལ་རྗེས་སུ་ཡི་རང་བར་མི་བྱའོ་
en: I myself will never teach, make someone teach, or rejoice in someone teaching anyone wrong views!’

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལོག་པར་ལྟ་བ་སྤངས་པ་ཡིན་ནོ། །
en: Noble son, this is how bodhisattva great beings abandon wrong views.

source: གནོད་སེམས་ལོག་པར་ལྟ་བ་གཉིས། །ཡོང་གིས་མི་འདོད་གང་ཡིན་པ། དེ་ནི་གནོད་སེམས་མི་བྱེད་དེ། །གང་ལའང་ལོག་པར་མི་འཇུག་གོ། །
en: “All those who dislike Ill will or wrong views Should not entertain ill will Or wrong views toward anything.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་དག་ལ་མངོན་པར་བརྩོན་པར་བྱེད་དོ། །
en: “Noble son, this is how bodhisattva great beings exert themselves on the path of the ten virtuous actions.”

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་བསྟན་པ་འདི་བཤད་པ་ན་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ། །
en: As this teaching on the path of the ten virtuous actions was spoken, countless beings gave rise to the mind set on unsurpassed and perfect awakening.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་རྒྱན་དང་། སྤུད་པ་དང་། ལྷབ་ལྷུབ་བཀོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་ལས་ལེའུ་དང་པོའོ།། །།
en: This was the first chapter of the Great Vehicle sūtra called “The Array That Ornaments, Adorns, and Decorates All Buddha Qualities.”

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་པོ་སེམས་བསྐྱེད་པས་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བཅུ་ལ་མངོན་པར་བརྩོན་པར་བྱའོ། །
en: “Furthermore, noble son, after having first given rise to the mind set on awakening, bodhisattva great beings should exert themselves in the ten perfections.

source: བཅུ་གང་ཞེ་ན།
en: What are those ten?

source: འདི་ལྟ་སྟེ། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཐབས་དང་། སྨོན་ལམ་དང་། སྟོབས་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: They are the perfections of generosity, discipline, patience, diligence, concentration, insight, skillful means, aspiration, power, and wisdom.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་བཅུ་པོ་དེ་དག་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: Noble son, how do bodhisattva great beings exert themselves in those ten perfections?

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྦྱིན་པ་སྦྱིན་པར་བྱེད།
en: Noble son, bodhisattva great beings practice generosity,

source: ཚུལ་ཁྲིམས་སྲུང་བར་བྱེད།
en: observe discipline,

source: བཟོད་པ་སྒོམ་པར་བྱེད།
en: cultivate patience,

source: བརྩོན་འགྲུས་རྩོམ་པར་བྱེད།
en: engender diligence,

source: བསམ་གཏན་ལ་བསམ་གཏན་དུ་བྱེད།
en: rest in concentration,

source: ཤེས་རབ་འབར་བར་བྱེད།
en: cause insight to blaze,

source: ཐབས་ལ་མཁས་པར་བྱེད།
en: become skilled in means,

source: སྨོན་ལམ་འདེབས་པར་བྱེད།
en: form aspiration prayers,

source: སྟོབས་ལ་འཇུག་པར་བྱེད།
en: apply the powers,

source: ཡེ་ཤེས་ལ་འཇུག་པར་བྱེད་དོ། །
en: and embrace wisdom.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “Noble son, how do bodhisattva great beings exert themselves in the perfection of generosity?
